Conf.Simple/src/InformationRegisters/SUI_docs_tbl_goods_delta/SUI_docs_tbl_goods_delta.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_docs_tbl_goods_delta</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>d_qtty</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>id_cell</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>id_good</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>id_price</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>id_properties</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>id_series</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>id_unit</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>price</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>use_series</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ТипТаблицы</name>
    <type>
      <types>EnumRef.SUI_ТипыТаблицДокументовОбмена</types>
    </type>
  </attributes>
  <dimensions>
    <name>sid</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>sid_doc</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>МобильноеУстройство</name>
    <type>
      <types>ExchangePlanRef.SUI_МобильныеУстройства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/AccumulationRegisters/ТоварыВЯчейках/ТоварыВЯчейках.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="ea232e9c-2f7d-4380-8ea3-543f63d0a155">
  <name>ТоварыВЯчейках</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="ac969acb-7b93-4fb5-88a4-8ffafa290913">
    <name>ВНаличии</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="ad99eb3f-4b74-4ff7-9e1d-cd183c5b0e92">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="2eac0d5a-dc44-4ecb-9f52-9d0e1da89e1c">
    <name>Ячейка</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

Conf.Simple/src/InformationRegisters/SUI_tbl_label_templates/SUI_tbl_label_templates.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_tbl_label_templates</name>
  <resources>
    <name>containsDM</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>height</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>isZPL</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>layout</name>
    <comment>Двоичные данные макета шаблона этикетки строкой Base64</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>name</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>width</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>id</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/Enums/SUI_ТипыТаблицДокументовОбмена/SUI_ТипыТаблицДокументовОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>SUI_ТипыТаблицДокументовОбмена</name>
  <enumValues>
    <name>Отбор</name>
  </enumValues>
  <enumValues>
    <name>Размещение</name>
  </enumValues>
  <enumValues>
    <name>Товары</name>
  </enumValues>
  <enumValues>
    <name>ШтрихкодыУпаковок</name>
  </enumValues>
  <enumValues>
    <name>ПотокШтрихкодов</name>
  </enumValues>
  <enumValues>
    <name>Серии</name>
  </enumValues>
</mdclass:Enum>

Conf.Simple/src/Enums/SUI_ТаблицыИнтеграции/SUI_ТаблицыИнтеграции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>SUI_ТаблицыИнтеграции</name>
  <enumValues>
    <name>Контрагенты</name>
  </enumValues>
  <enumValues>
    <name>Склады</name>
  </enumValues>
  <enumValues>
    <name>Ячейки</name>
  </enumValues>
  <enumValues>
    <name>Номенклатура</name>
  </enumValues>
  <enumValues>
    <name>ХарактеристикиНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>СерииНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ЕдиницыИзмерения</name>
  </enumValues>
  <enumValues>
    <name>УпаковкиНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>Удалить_ВидыНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ШтрихкодыНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ШтрихкодыУпаковок</name>
  </enumValues>
  <enumValues>
    <name>Документы</name>
  </enumValues>
  <enumValues>
    <name>НастройкиДокументов</name>
  </enumValues>
  <enumValues>
    <name>ШаблоныЭтикеток</name>
  </enumValues>
  <enumValues>
    <name>ПользователиТСД</name>
  </enumValues>
</mdclass:Enum>

Conf.Simple/src/Catalogs/SUI_НастройкиДокументов/SUI_НастройкиДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>SUI_НастройкиДокументов</name>
  <attributes>
    <name>ГрупповоеСканирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныеНастройки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗагружатьВДокумент1СПослеПолученияИзТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяОбъектаМетаданных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяМаркировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиСхемыКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроводитьДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СинонимОбъектаМетаданных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеДокументаПоУмолчанию</name>
    <type>
      <types>EnumRef.SUI_СостоянияДокументовОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>Агрегация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ComputerVision</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьДокументыНаТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмСозданияНовогоДокумента</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗавершатьДокумент1СПослеПолученияИзТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НастройкиЗаполненияРеквизитовПередЗаписью</name>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ПриРасхождении</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НастройкиСозданияДокументовНаОснованииПослеЗаписи</name>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПриРасхождении</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Проводить</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НастройкиТабличныхЧастей</name>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипТаблицы</name>
      <type>
        <types>EnumRef.SUI_ТипыТаблицДокументовОбмена</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяТабличнойЧасти</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>80</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УдалятьПустыеСтроки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПропускатьПриЗаписи</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоответствияРеквизитов</name>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоответствияРеквизитовТабличныхЧастей</name>
    <attributes>
      <name>ИмяТабличнойЧасти</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипТаблицы</name>
      <type>
        <types>EnumRef.SUI_ТипыТаблицДокументовОбмена</types>
      </type>
    </attributes>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СопоставлениеРеквизитовТабличныхЧастей</name>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Поле</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>80</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяРеквизита</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>80</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИспользуетсяПостоянноеЗначение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПостоянноеЗначение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НастройкиВыводаДополнительныхПолей</name>
    <attributes>
      <name>РеквизитДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяНаУстройстве</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Conf.Simple/src/CommonModules/SUI_ОбменДаннымиСервер/Module.bsl
#Область ПрограммныйИнтерфейс

// Получить данные для ответа HTTP
//
// Параметры:
//  МобильноеУстройство	- СправочникСсылка.Удалить_SUI_МобильныеКлиенты, ПланОбменаСсылка.SUI_МобильныеУстройства - Ссылка на мобильное устройство
//  НСИ		 			- Булево - Признак получения данных НСИ
//  Документы 			- Булево - Признак получения данных документов обмена
// 
// Возвращаемое значение:
//  Структура - см. SUI_HTTPСервис.РезультатУспех
//
Функция ПолучитьДанные(МобильноеУстройство, НСИ = Истина, Документы = Истина, ОфлайнОбмен = Ложь) Экспорт
	
	Данные = SUI_СообщенияОбменаДанными.ПолучитьСообщениеДляМобильногоУстройства(МобильноеУстройство, Истина);
	
	Если ОфлайнОбмен Тогда
		Возврат Данные;		
	Иначе
		Результат = SUI_HTTPСервис.РезультатУспех(Данные.Данные);
		SUI_HTTPСервис.ДобавитьЗаголовокВРезультат(Результат, "Remaining-Batches", Данные.ОстатокПакетов);
		Возврат Результат;
	КонецЕсли;

КонецФункции

Функция СоздатьДокумент(МобильноеУстройство, НастройкаДокумента) Экспорт
	
	НастройкиДокумента = SUI_НастройкиДокументовСервер.СформироватьНастройкиДокумента(НастройкаДокумента);
	
	ОбщегоНазначенияКлиентСервер.Проверить(НастройкиДокумента.Используется,
		СтрШаблон(НСтр("ru = 'Настройка %1 не используется'"), НастройкаДокумента));
	
	ОбщегоНазначенияКлиентСервер.Проверить(НастройкиДокумента.СоздаватьДокументыНаТСД,
		СтрШаблон(НСтр("ru = 'Для настройки %1 режим создания документов выключен'"), НастройкаДокумента));
	
	ОбщегоНазначенияКлиентСервер.Проверить(
		SUI_НастройкиДокументовСервер.НастройкаДокументаПринадлежитМобильномуКлиенту(НастройкаДокумента, МобильноеУстройство),
		СтрШаблон(НСтр("ru = 'Настройка %1 не принадлежит мобильному устройству %2'"), НастройкаДокумента, МобильноеУстройство));
	
	НачатьТранзакцию();
	
	Попытка
		
		УстановитьПривилегированныйРежим(Истина);
		
		НовыйДокумент = Документы[НастройкиДокумента.ИмяМетаданных].СоздатьДокумент();
		НовыйДокумент.Дата = ТекущаяДатаСеанса();
		НовыйДокумент.УстановитьНовыйНомер();
		
		Результат = Обработки.SUI_РедакторКода.ВыполнитьКодЧерезМетодКонфигурации(
			"SUI_ОбменДаннымиСервер.ВыполнитьАлгоритмСозданияДокумента",
			НастройкиДокумента.АлгоритмСозданияНовогоДокумента,
			SUI_ОбщегоНазначенияКлиентСерверПереопределяемый.МассивЗначений(МобильноеУстройство, НовыйДокумент),
			Истина);
		
		НовыйДокумент = Результат[Результат.ВГраница()];
		
		Если НовыйДокумент.Ссылка.Пустая() Тогда
			НовыйДокумент.ОбменДанными.Загрузка = Истина;
			НовыйДокумент.Записать(РежимЗаписиДокумента.Запись);
		КонецЕсли;
		
		ОбщегоНазначенияКлиентСервер.Проверить(
			SUI_НастройкиДокументовСервер.ДокументСоответствуетОтборуНастройки(НастройкаДокумента, НовыйДокумент.Ссылка), 
			СтрШаблон(НСтр("ru = 'Сформированный документ не соответствует критериям отбора настройки документа ""%1"".'"), 
			НастройкаДокумента));
		
		// Выгрузить документ на ТСД
		ПараметрыВыгрузкиДокументаОбмена = SUI_ДокументыОбмена.ПараметрыВыгрузкиДокументаОбмена();
		ПараметрыВыгрузкиДокументаОбмена.МобильноеУстройство 	= МобильноеУстройство;
		ПараметрыВыгрузкиДокументаОбмена.НастройкаДокумента 	= НастройкаДокумента.Ссылка;
		ПараметрыВыгрузкиДокументаОбмена.ДокументСсылка 		= НовыйДокумент.Ссылка;
		ПараметрыВыгрузкиДокументаОбмена.Вставить("SUI_АдресноеХранение", НастройкиДокумента.ЭтоДокументАдресногоХранения);
		ПараметрыВыгрузкиДокументаОбмена.Вставить("НеРегистрироватьИзменения");
		
		ДанныеДокументаОбмена = SUI_ДокументыОбмена.ВыгрузитьИПолучитьДокументОбмена(ПараметрыВыгрузкиДокументаОбмена);
		
		ОбщегоНазначенияКлиентСервер.Проверить(ДанныеДокументаОбмена <> Неопределено, 
			НСтр("ru = 'Не удалось получить данные созданного документа.'"));
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	Возврат SUI_HTTPСервис.РезультатУспех(ДанныеДокументаОбмена);
	
КонецФункции

// Загрузить данные.
// 
// Параметры:
//  МобильноеУстройство - СправочникСсылка.Удалить_SUI_МобильныеКлиенты, ПланОбменаСсылка.SUI_МобильныеУстройства - Мобильное устройство
//  ДанныеДокументов - Массив - Данные документов
// 
// Возвращаемое значение:
//  Структура - Загрузить данные:
// * КодСостояния - Число - Код HTTP состояния
// * ТекстОшибки - Строка - Текст ошибки
// * Данные - Произвольный, Структура, Массив, Неопределено -:
// ** result - Булево -
// * Заголовки - Соответствие, Неопределено -
//@skip-check doc-comment-collection-item-type
Функция ЗагрузитьДанныеДокументов(МобильноеУстройство, ДанныеДокументов, ОфлайнОбмен = Ложь) Экспорт
	
	Возврат SUI_ОбменДаннымиСерверПереопределяемый.ЗагрузитьДанныеДокументов(МобильноеУстройство, ДанныеДокументов);
	
	ТипЗначенияДанныеДокументов = ТипЗнч(ДанныеДокументов);
	
	Если ПолучитьФункциональнуюОпцию("SUI_ОнлайнОбмен") И ТипЗначенияДанныеДокументов = Тип("Строка") Тогда
		
		ДанныеДокументов = SUI_СообщенияОбменаДанными.ВосстановитьСжатуюСтроку(ДанныеДокументов);
		Если Не ПустаяСтрока(ДанныеДокументов) Тогда
			ДанныеДокументов = SUI_ОбщегоНазначенияКлиентСервер.ДанныеИзСтрокиJSON(ДанныеДокументов, Ложь, , ,
				"ВосстановлениеДанныхJSON_ДанныеДокумента", SUI_ОбменДаннымиСервер);
			ТипЗначенияДанныеДокументов = ТипЗнч(ДанныеДокументов);
		КонецЕсли;
		
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.Проверить(ТипЗначенияДанныеДокументов = Тип("Массив"),
		СтрШаблон(НСтр("ru = 'Тип данных документов должен быть типом ""Массив"". Полученный тип: ""%1""'"), ТипЗначенияДанныеДокументов));
	
	РезультатЗагрузки = Новый Структура();
	РезультатЗагрузки.Вставить("total", ДанныеДокументов.Количество());
	РезультатЗагрузки.Вставить("quantity_uploaded", 0);
	
	Для Индекс = 0 По ДанныеДокументов.ВГраница() Цикл
		
		ПараметрыЗагрузки = SUI_ДокументыОбмена.ПараметрыЗагрузкиДокументаОбмена();
		ПараметрыЗагрузки.МобильноеУстройство = МобильноеУстройство;
		ПараметрыЗагрузки.Данные.id_doc = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
			ДанныеДокументов[Индекс], "id_doc", "", Тип("Строка"));

		Если ДанныеДокументов[Индекс].Свойство("RS_docs_table") Тогда
			ПараметрыЗагрузки.Данные.Таблицы.Вставить(Перечисления.SUI_ТипыТаблицДокументовОбмена.Товары,
				SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеДокументов[Индекс], "RS_docs_table",
				SUI_ДокументыОбмена.ТаблицаТоварыДокументаОбмена()));
		ИначеЕсли ДанныеДокументов[Индекс].Свойство("RS_adr_docs_table") Тогда
			ПараметрыЗагрузки.Данные.Таблицы.Вставить(Перечисления.SUI_ТипыТаблицДокументовОбмена.Товары,
				SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеДокументов[Индекс], "RS_adr_docs_table",
				SUI_ДокументыОбмена.ТаблицаТоварыДокументаОбмена()));
		КонецЕсли;
		
		ПараметрыЗагрузки.Данные.Таблицы.Вставить(Перечисления.SUI_ТипыТаблицДокументовОбмена.Серии,
			SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
				ДанныеДокументов[Индекс], "RS_docs_series", SUI_ДокументыОбмена.ТаблицаСерииДокументаОбмена()));
			
		ПараметрыЗагрузки.Данные.Таблицы.Вставить(Перечисления.SUI_ТипыТаблицДокументовОбмена.ШтрихкодыУпаковок,
			SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
				ДанныеДокументов[Индекс], "RS_docs_barcodes", SUI_ДокументыОбмена.ТаблицаШтрихкодыДокументаОбмена()));
			
		ПараметрыЗагрузки.Данные.Таблицы.Вставить(Перечисления.SUI_ТипыТаблицДокументовОбмена.ПотокШтрихкодов,
			SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
				ДанныеДокументов[Индекс], "RS_barc_flow", SUI_ДокументыОбмена.ТаблицаПотокШтрихкодовОбмена()));
		
		ДанныеЗагружены = SUI_ДокументыОбмена.ЗагрузитьДокументОбмена(ПараметрыЗагрузки);
		
		Если ДанныеЗагружены Тогда
			РезультатЗагрузки.quantity_uploaded = РезультатЗагрузки.quantity_uploaded + 1;
		КонецЕсли;

	КонецЦикла;
	
	РезультатЗагрузки.Вставить("result", (РезультатЗагрузки.total > 0 И РезультатЗагрузки.quantity_uploaded > 0));
	
	Возврат РезультатЗагрузки;
	
КонецФункции

#Область ГрупповойПересчетДокумента

Функция ПолучитьДанныеГрупповогоПересчетаДокумента(МобильноеУстройство, ИдентификаторДокумента) Экспорт
	
	ДанныеПересчета = РегистрыСведений.SUI_docs_tbl_goods_delta.ПолучитьДанныеПересчетаСтрок(
		МобильноеУстройство, ИдентификаторДокумента);
	
	Возврат SUI_HTTPСервис.РезультатУспех(ДанныеПересчета);
	
КонецФункции

Функция ПараметрыЗагрузкиГрупповогоПересчета(МобильноеУстройство, ДанныеПересчета) Экспорт
	
	ПараметрыЗагрузки = Новый Структура();
	ПараметрыЗагрузки.Вставить("МобильноеУстройство", 		МобильноеУстройство);
	ПараметрыЗагрузки.Вставить("ДанныеПересчета", 			ДанныеПересчета);
	ПараметрыЗагрузки.Вставить("Перезаписать", 				Ложь);
	ПараметрыЗагрузки.Вставить("ЗагрузкаЧерезHTTPСервис", 	Истина);
	ПараметрыЗагрузки.Вставить("ИдентификаторДокумента", 	"");
	
	Возврат ПараметрыЗагрузки;
	
КонецФункции

Функция ЗагрузитьДанныеГрупповогоПересчетаДокумента(ПараметрыЗагрузки) Экспорт
	
	Результат = Ложь;
	
	Если ПараметрыЗагрузки.ЗагрузкаЧерезHTTPСервис И ПустаяСтрока(ПараметрыЗагрузки.ИдентификаторДокумента) Тогда
		ТекстОшибки = НСтр("ru = 'Не передан идентификатор документа в параметрах загрузки'");
		КонтекстПроверки = "SUI_ОбменДаннымиСервер.ЗагрузитьДанныеГрупповогоПересчетаДокумента";
		ОбщегоНазначенияКлиентСервер.Проверить(Ложь, ТекстОшибки, КонтекстПроверки);
	КонецЕсли;
	
	Для Каждого КлючЗначение Из ПараметрыЗагрузки.ДанныеПересчета Цикл
		
		Если Не ПустаяСтрока(ПараметрыЗагрузки.ИдентификаторДокумента) И
			ПараметрыЗагрузки.ИдентификаторДокумента <> КлючЗначение.Ключ Тогда
			Продолжить;
		КонецЕсли;
		
		РезультатЗагрузки = РегистрыСведений.SUI_docs_tbl_goods_delta.ЗагрузитьПересчет(
			ПараметрыЗагрузки.МобильноеУстройство, КлючЗначение.Ключ, КлючЗначение.Значение, 
			ПараметрыЗагрузки.Перезаписать);
		
		Если РезультатЗагрузки.Ошибки.Количество() > 0 Тогда
			ВызватьИсключение СтрШаблон(НСтр("ru = 'Не удалось загрузить данные пересчета!
			|%1'"), СтрСоединить(РезультатЗагрузки.Ошибки, Символы.ПС));
		КонецЕсли;
		
		Если РезультатЗагрузки.ДанныеЗагружены Тогда
			Результат = Истина;
		КонецЕсли;
		
	КонецЦикла;

	Если ПараметрыЗагрузки.ЗагрузкаЧерезHTTPСервис Тогда
		
		ДанныеПересчета = РегистрыСведений.SUI_docs_tbl_goods_delta.ПолучитьДанныеПересчетаСтрок(
			ПараметрыЗагрузки.МобильноеУстройство, ПараметрыЗагрузки.ИдентификаторДокумента);
		
		Результат = Новый Структура("result", Результат);
		Результат.Вставить("data", ДанныеПересчета);
		
		Результат = SUI_HTTPСервис.РезультатУспех(Результат);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЗавершитьГрупповойПересчетДокумента(МобильноеУстройство, ИдентификаторДокумента, Знач ДополнительныеПараметры = Неопределено) Экспорт
	
	РегистрыСведений.SUI_docs_tbl_goods_delta.СоздатьЗаданиеЗавершенияПересчета(МобильноеУстройство, ИдентификаторДокумента);
	
	Результат = Новый Структура();
	Результат.Вставить("result", Истина);
	
	Возврат SUI_HTTPСервис.РезультатУспех(Результат);
	
КонецФункции

#КонецОбласти

Функция ПолучитьЦеныНоменклатуры(ПараметрыПолучения) Экспорт

	мсвДанныеЦенНоменклатуры = Новый Массив();

	Запрос = Новый Запрос;

	Запрос.УстановитьПараметр("Номенклатура", SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыПолучения, 
		"Номенклатура", Справочники.Номенклатура.ПустаяСсылка(), Тип("СправочникСсылка.Номенклатура")));
	Запрос.УстановитьПараметр("Характеристика", SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыПолучения, 
		"Характеристика", Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка(), Тип("СправочникСсылка.ХарактеристикиНоменклатуры")));
	Запрос.УстановитьПараметр("Упаковка", SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыПолучения, 
		"Упаковка", Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка(), Тип("СправочникСсылка.УпаковкиЕдиницыИзмерения")));
	Запрос.УстановитьПараметр("ВидЦены", SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыПолучения, 
		"ВидЦены", Справочники.ВидыЦен.ПустаяСсылка(), Тип("СправочникСсылка.ВидыЦен")));
	
	ОбщегоНазначенияКлиентСервер.Проверить(ЗначениеЗаполнено(Запрос.Параметры.Номенклатура), 
		НСтр("ru = 'Передано пустое значение параметра номенклатуры'"), 
		КонтекстВызова("ПолучитьЦеныНоменклатуры"));

	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦеныНоменклатуры.Номенклатура КАК id_good,
		|	ЕСТЬNULL(ЦеныНоменклатуры.Номенклатура.Представление, """") КАК name_good,
		|	ЦеныНоменклатуры.Характеристика КАК id_property,
		|	ЕСТЬNULL(ЦеныНоменклатуры.Характеристика.Представление, """") КАК name_property,
		|	ЦеныНоменклатуры.ВидЦены КАК id_price_type,
		|	ЕСТЬNULL(ЦеныНоменклатуры.ВидЦены.Представление, """") КАК name_price_type,
		|	ЦеныНоменклатуры.Упаковка КАК id_unit,
		|	ЕСТЬNULL(ЦеныНоменклатуры.Упаковка.Представление, """") КАК name_unit,
		|	ЦеныНоменклатуры.Цена КАК price
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		|			,
		|			Номенклатура = &Номенклатура
		|				И ВЫБОР
		|					КОГДА &Характеристика <> ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
		|						ТОГДА Характеристика = &Характеристика
		|					ИНАЧЕ ИСТИНА
		|				КОНЕЦ
		|				И ВЫБОР
		|					КОГДА &ВидЦены <> ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
		|						ТОГДА ВидЦены = &ВидЦены
		|					ИНАЧЕ ИСТИНА
		|				КОНЕЦ
		|				И ВЫБОР
		|					КОГДА &Упаковка <> ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
		|						ТОГДА Упаковка = &Упаковка
		|					ИНАЧЕ ИСТИНА
		|				КОНЕЦ) КАК ЦеныНоменклатуры";

	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();

	Если Не РезультатЗапроса.Пустой() Тогда
		
		ИменаКолонок = SUI_ОбщегоНазначения.ПолучитьИменаКолонокРезультатаЗапроса(РезультатЗапроса);

		Выборка = РезультатЗапроса.Выбрать();

		Пока Выборка.Следующий() Цикл
			
			сткДанныеЦеныНоменклатуры = Новый Структура(ИменаКолонок);
			ЗаполнитьЗначенияСвойств(сткДанныеЦеныНоменклатуры, Выборка);
			мсвДанныеЦенНоменклатуры.Добавить(сткДанныеЦеныНоменклатуры);
	
		КонецЦикла;
	
	КонецЕсли;

	Возврат SUI_HTTPСервис.РезультатУспех(мсвДанныеЦенНоменклатуры);

КонецФункции

Функция ПолучитьОстаткиНоменклатурыВЯчейке(ПараметрыПолучения) Экспорт

	мсвДанныеОстатков = Новый Массив();
	
	Запрос = Новый Запрос;

	//Запрос.УстановитьПараметр("Номенклатура", SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыПолучения, 
	//	"Номенклатура", Справочники.Номенклатура.ПустаяСсылка(), Тип("СправочникСсылка.Номенклатура")));
	Запрос.УстановитьПараметр("Ячейка", SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыПолучения, 
		"Ячейка", Справочники.СкладскиеЯчейки.ПустаяСсылка(), Тип("СправочникСсылка.СкладскиеЯчейки")));
	
	ОбщегоНазначенияКлиентСервер.Проверить(ЗначениеЗаполнено(Запрос.Параметры.Ячейка), 
		НСтр("ru = 'Передано пустое значение параметра ячейки'"), 
		КонтекстВызова("ПолучитьОстаткиНоменклатурыВЯчейке"));

	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыВЯчейкахОстатки.Номенклатура КАК id_good,
		|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Номенклатура.Представление, """") КАК name_good,
		|	ТоварыВЯчейкахОстатки.Характеристика КАК id_property,
		|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Характеристика.Представление, """") КАК name_property,
		|	ТоварыВЯчейкахОстатки.Упаковка КАК id_unit,
		|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Упаковка.Представление, """") КАК name_unit,
		|	ТоварыВЯчейкахОстатки.Ячейка КАК id_cell,
		|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Ячейка.Код, """") КАК name_cell,
		|	ТоварыВЯчейкахОстатки.Серия КАК id_series,
		|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Серия.Представление, """") КАК name_series,
		|	ТоварыВЯчейкахОстатки.ВНаличииОстаток КАК qtty
		|ИЗ
		|	РегистрНакопления.ТоварыВЯчейках.Остатки(
		|			,
		|			ВЫБОР
		|				КОГДА &Ячейка <> ЗНАЧЕНИЕ(Справочник.СкладскиеЯчейки.ПустаяСсылка)
		|					ТОГДА Ячейка = &Ячейка
		|				ИНАЧЕ ИСТИНА
		|			КОНЕЦ) КАК ТоварыВЯчейкахОстатки";

	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();

	Если Не РезультатЗапроса.Пустой() Тогда
		
		ИменаКолонок = SUI_ОбщегоНазначения.ПолучитьИменаКолонокРезультатаЗапроса(РезультатЗапроса);
		
		Выборка = РезультатЗапроса.Выбрать();
	
		Пока Выборка.Следующий() Цикл
			
			сткДанныеОстатка = Новый Структура(ИменаКолонок);
			ЗаполнитьЗначенияСвойств(сткДанныеОстатка, Выборка);
			мсвДанныеОстатков.Добавить(сткДанныеОстатка);
	
		КонецЦикла;
		
	КонецЕсли;

	Возврат SUI_HTTPСервис.РезультатУспех(мсвДанныеОстатков);

КонецФункции

Функция ПолучитьОстаткиНоменклатурыНаСкладах(ПараметрыПолучения) Экспорт

	мсвДанныеОстатков = Новый Массив();

	Запрос = Новый Запрос;

	Запрос.УстановитьПараметр("Номенклатура", SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыПолучения, 
		"Номенклатура", Справочники.Номенклатура.ПустаяСсылка(), Тип("СправочникСсылка.Номенклатура")));
	Запрос.УстановитьПараметр("Склад", SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыПолучения, 
		"Склад", Справочники.Склады.ПустаяСсылка(), Тип("СправочникСсылка.Склады")));
	
	ОбщегоНазначенияКлиентСервер.Проверить(ЗначениеЗаполнено(Запрос.Параметры.Номенклатура), 
		НСтр("ru = 'Передано пустое значение параметра номенклатуры'"), 
		КонтекстВызова("ПолучитьОстаткиНоменклатурыНаСкладах"));

	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыНаСкладахОстатки.Номенклатура КАК id_good,
		|	ЕСТЬNULL(ТоварыНаСкладахОстатки.Номенклатура.Представление, """") КАК name_good,
		|	ТоварыНаСкладахОстатки.Характеристика КАК id_property,
		|	ЕСТЬNULL(ТоварыНаСкладахОстатки.Характеристика.Представление, """") КАК name_property,
		|	ТоварыНаСкладахОстатки.Склад КАК id_warehouse,
		|	ЕСТЬNULL(ТоварыНаСкладахОстатки.Склад.Представление, """") КАК name_warehouse,
		|	ТоварыНаСкладахОстатки.Серия КАК id_series,
		|	ЕСТЬNULL(ТоварыНаСкладахОстатки.Серия.Представление, """") КАК name_series,
		|	ТоварыНаСкладахОстатки.ВНаличииОстаток КАК qtty
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Остатки(
		|			,
		|			Номенклатура = &Номенклатура
		|				И ВЫБОР
		|					КОГДА &Склад <> ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
		|						ТОГДА Склад = &Склад
		|					ИНАЧЕ ИСТИНА
		|				КОНЕЦ) КАК ТоварыНаСкладахОстатки";

	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		ИменаКолонок = SUI_ОбщегоНазначения.ПолучитьИменаКолонокРезультатаЗапроса(РезультатЗапроса);

		Выборка = РезультатЗапроса.Выбрать();
	
		Пока Выборка.Следующий() Цикл
			
			сткДанныеОстатка = Новый Структура(ИменаКолонок);
			ЗаполнитьЗначенияСвойств(сткДанныеОстатка, Выборка);
			мсвДанныеОстатков.Добавить(сткДанныеОстатка);
	
		КонецЦикла;
		
	КонецЕсли;

	Возврат SUI_HTTPСервис.РезультатУспех(мсвДанныеОстатков);

КонецФункции

Функция ПолучитьШаблоныЭтикеток() Экспорт

	ШаблоныЭтикеток = Новый Массив();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	SUI_tbl_label_templates.name КАК name,
		|	SUI_tbl_label_templates.layout КАК html,
		|	SUI_tbl_label_templates.height КАК height,
		|	SUI_tbl_label_templates.width КАК width,
		|	SUI_tbl_label_templates.isZPL КАК isZPL,
		|	SUI_tbl_label_templates.containsDM
		|ИЗ
		|	РегистрСведений.SUI_tbl_label_templates КАК SUI_tbl_label_templates";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		ИменаКолонок = SUI_ОбщегоНазначения.ПолучитьИменаКолонокРезультатаЗапроса(РезультатЗапроса);
		
		Выборка = РезультатЗапроса.Выбрать();
	
		Пока Выборка.Следующий() Цикл
			
			ДанныеШаблона = Новый Структура(ИменаКолонок);
			
			ЗаполнитьЗначенияСвойств(ДанныеШаблона, Выборка);
			
			ДанныеШаблона.html = ДанныеШаблона.html.Получить();
			
			Если Не ЗначениеЗаполнено(ДанныеШаблона.html) Тогда
				Продолжить;
			КонецЕсли;
			
			ШаблоныЭтикеток.Добавить(ДанныеШаблона);
			
		КонецЦикла;
	
	КонецЕсли;

	Возврат SUI_HTTPСервис.РезультатУспех(ШаблоныЭтикеток);
	
КонецФункции

Функция СоздатьШтрихкодыНоменклатуры(МобильноеУстройство, ДанныеШтрихкодов, ОфлайнОбмен = Ложь) Экспорт
	
	ОбщегоНазначенияКлиентСервер.Проверить(ПолучитьФункциональнуюОпцию("SUI_ИспользоватьТаблицу_ШтрихкодыНоменклатуры"),
		НСтр("ru = 'Таблица штрихкоды номенклатуры не используется.'"));
	
	ЗагруженоОбъектов = 0;
	
	НачатьТранзакцию();
	
	Попытка
		
		НастройкаИнтеграции = SUI_НастройкиМетаданныхСервер.ПолучитьДополнительныеНастройки(
			Перечисления.SUI_ТаблицыИнтеграции.ШтрихкодыНоменклатуры, Ложь);
		
		АлгоритмСозданияШтрихкодаНоменклатуры = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(НастройкаИнтеграции, 
			"АлгоритмСозданияШтрихкодаНоменклатуры.Алгоритм", "", Тип("Строка"));
		
		ОбщегоНазначенияКлиентСервер.Проверить(ЗначениеЗаполнено(АлгоритмСозданияШтрихкодаНоменклатуры), 
			НСтр("ru = 'Отсутствует алгоритм создания штрихкода номенклатуры.'"));

		Для Каждого СтрокаДанныхШтрихкода Из ДанныеШтрихкодов Цикл
			
			//@skip-check structure-consructor-too-many-keys
			ДанныеШтрихкода = Новый Структура("barcode,id_good,id_property,id_unit");
			
			ЗаполнитьЗначенияСвойств(ДанныеШтрихкода, СтрокаДанныхШтрихкода);
			
			SUI_ИнтеграцияВКонфигурацию.ВосстановитьСсылкиИдентификаторовSimple(ДанныеШтрихкода, , Ложь);
			
			// Создать через произвольный алгоритм
			Результат = SUI_ШтрихкодыНоменклатуры.СоздатьШтрихкодНоменклатуры(АлгоритмСозданияШтрихкодаНоменклатуры, 
				ДанныеШтрихкода.barcode, 
				ДанныеШтрихкода.id_good, 
				ДанныеШтрихкода.id_property, 
				ДанныеШтрихкода.id_unit);
			
			Если Результат Тогда
				ЗагруженоОбъектов = ЗагруженоОбъектов + 1;
			КонецЕсли;
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	РезультатЗагрузки = Новый Структура();

	РезультатЗагрузки.Вставить("result", 			(ДанныеШтрихкодов.Количество() > 0 И ЗагруженоОбъектов > 0));
	РезультатЗагрузки.Вставить("total", 			ДанныеШтрихкодов.Количество());
	РезультатЗагрузки.Вставить("quantity_uploaded", ЗагруженоОбъектов);

	//@skip-check constructor-function-return-section 
	Если ОфлайнОбмен Тогда  
		Возврат (РезультатЗагрузки);		
	Иначе
		Возврат SUI_HTTPСервис.РезультатУспех(РезультатЗагрузки);
	КонецЕсли; 
	
КонецФункции

Функция ВыполнитьПользовательскийЗапрос(МобильноеУстройство, НастройкиЗапроса) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Оценка производительности
	ОценкаПроизводительности_НачалоЗамера = SUI_ОценкаПроизводительностиПереопределяемый.НачатьЗамерВремени();
	ОценкаПроизводительности_КлючеваяОперация = "ВыполнитьПользовательскийЗапрос";
	ОценкаПроизводительности_Комментарий = "";
	
	ДанныеШаблонаЭтикетки = Новый Структура("id, name");
	ЗаполнитьЗначенияСвойств(ДанныеШаблонаЭтикетки, SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		НастройкиЗапроса, "label_template", Новый Структура(), Тип("Структура")));
	
	Если ДанныеШаблонаЭтикетки.id = Неопределено И ДанныеШаблонаЭтикетки.name = Неопределено Тогда
		ДанныеШаблонаЭтикетки.name = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(НастройкиЗапроса, "name", "", Тип("Строка"));
		Если ПустаяСтрока(ДанныеШаблонаЭтикетки.name) Тогда
			ДанныеШаблонаЭтикетки.name = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Если ДанныеШаблонаЭтикетки.id <> Неопределено Или ДанныеШаблонаЭтикетки.name <> Неопределено Тогда

		ТекстОшибки = "";
		
		Если ДанныеШаблонаЭтикетки.id <> Неопределено Тогда
			РезультатПоЗначению = SUI_ИнтеграцияВКонфигурацию.НайтиВТаблицеПоЗначению(
				Перечисления.SUI_ТаблицыИнтеграции.ШаблоныЭтикеток, "id", ДанныеШаблонаЭтикетки.id);
		ИначеЕсли ДанныеШаблонаЭтикетки.name <> Неопределено Тогда
			РезультатПоЗначению = SUI_ИнтеграцияВКонфигурацию.НайтиВТаблицеПоЗначению(
				Перечисления.SUI_ТаблицыИнтеграции.ШаблоныЭтикеток, "name", ДанныеШаблонаЭтикетки.name);
		Иначе
			РезультатПоЗначению = Неопределено;
		КонецЕсли;
		
		Если РезультатПоЗначению = Неопределено Тогда
			
			СообщенияПользователю = ПолучитьСообщенияПользователю();
			
			Если СообщенияПользователю.Количество() = 0 Тогда
				ТекстОшибки = СтрШаблон(НСтр("ru = 'Не удалось получить данные из таблицы ""%1""'"), 
					Перечисления.SUI_ТаблицыИнтеграции.ШаблоныЭтикеток);
			Иначе
				ТекстОшибки = СтрСоединить(СообщенияПользователю, Символы.ПС);
			КонецЕсли;
			
		ИначеЕсли РезультатПоЗначению.Пустой() Тогда
			ТекстОшибки = СтрШаблон(НСтр("ru = 'Шаблон этикетки по наименованию ""%1"" не найден'"), 
					Перечисления.SUI_ТаблицыИнтеграции.ШаблоныЭтикеток);
		Иначе
			
			ВыборкаШаблоныЭтикеток = РезультатПоЗначению.Выбрать();
			ВыборкаШаблоныЭтикеток.Следующий();
			
			ШаблонЭтикеткиСсылка = SUI_ИнтеграцияВКонфигурацию.СсылкаПоИдентификаторуSimple(ВыборкаШаблоныЭтикеток.id);
			
			ДанныеКонструктора = Справочники.SUI_ШаблоныЭтикетокZPL.ПолучитьДанныеКонструктораЗапроса(ШаблонЭтикеткиСсылка);
			
			Если ДанныеКонструктора = Неопределено Тогда
				ТекстОшибки = СтрШаблон(НСтр("ru = 'Для шаблона этикетки ""%1"" отсутствуют данные для выполнения запроса'"), 
						ШаблонЭтикеткиСсылка);
			КонецЕсли;
			
		КонецЕсли;
		
		ОбщегоНазначенияКлиентСервер.Проверить(ПустаяСтрока(ТекстОшибки), ТекстОшибки);
		
		ОценкаПроизводительности_Комментарий = СтрШаблон(НСтр("ru = 'Запрос из шаблона этикетки ""%1""'"), ШаблонЭтикеткиСсылка);
	
	Иначе
		
		ОбщегоНазначенияКлиентСервер.Проверить(
			ПолучитьФункциональнуюОпцию("SUI_ИспользоватьПользовательскийЗапрос"),
			НСтр("ru = 'Выполнение пользовательских запросов недоступно'"));
		
		УстановитьПривилегированныйРежим(Истина);
		ДанныеКонструктора = SUI_НастройкиМетаданныхСервер.ПолучитьПользовательскийЗапрос();
		УстановитьПривилегированныйРежим(Ложь);
		
		ОбщегоНазначенияКлиентСервер.Проверить(ЗначениеЗаполнено(ДанныеКонструктора.ТекстЗапроса),
			НСтр("ru = 'Не заполнен текст запроса для выполнения пользовательского запроса.'"));
		
		ОценкаПроизводительности_Комментарий = НСтр("ru = 'Пользовательский запрос'");
		
	КонецЕсли;
	
	ПараметрыЗапроса = Новый Структура();
	
	ПараметрыИзТелаЗапроса = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(НастройкиЗапроса, "params", Новый Массив(), Тип("Массив"));
	Для индекс = 0 По ПараметрыИзТелаЗапроса.ВГраница() Цикл
		
		ИмяПараметра = SUI_СтроковыеФункцииКлиентСервер.ПривестиСтрокуКРазрешеннымСимволам(
			СокрЛП(SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыИзТелаЗапроса[индекс], "name", "", Тип("Строка"))), 
			"_" + SUI_СтроковыеФункцииКлиентСервер.АлфавитЦифры()
			+ SUI_СтроковыеФункцииКлиентСервер.АлфавитБуквыЛатинские()
			+ SUI_СтроковыеФункцииКлиентСервер.АлфавитБуквыРусские());
		
		ОбщегоНазначенияКлиентСервер.Проверить(
			ЗначениеЗаполнено(ИмяПараметра),
			СтрШаблон(НСтр("ru = 'Не верное имя параметра [%1]'"), индекс));
		
		ПараметрыЗапроса.Вставить(ИмяПараметра, SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыИзТелаЗапроса[индекс], "value"));
		
	КонецЦикла;
	
	// Установка параметра запроса ДатаЗапроса (query_date)
	Если Не ПараметрыЗапроса.Свойство("ДатаЗапроса") Тогда
		ПараметрыЗапроса.Вставить("ДатаЗапроса", ТекущаяДатаСеанса());
	КонецЕсли;
	
	// Установка параметра запроса Пользователя
	Если Не ПараметрыЗапроса.Свойство("МобильноеУстройство") Тогда
		ПараметрыЗапроса.Вставить("МобильноеУстройство", МобильноеУстройство);
	КонецЕсли;
	
	Попытка
		Результат = SUI_КонструкторЗапроса.ВыполнитьЗапросКонструктораЗапроса(ДанныеКонструктора, ПараметрыЗапроса);
	Исключение
		SUI_ОценкаПроизводительностиПереопределяемый.ЗакончитьЗамерВремени(ОценкаПроизводительности_КлючеваяОперация, 
			ОценкаПроизводительности_НачалоЗамера, , ОценкаПроизводительности_Комментарий, Истина);
		ВызватьИсключение;
	КонецПопытки;
	
	// Оценка производительности
	SUI_ОценкаПроизводительностиПереопределяемый.ЗакончитьЗамерВремени(ОценкаПроизводительности_КлючеваяОперация, 
		ОценкаПроизводительности_НачалоЗамера, Результат.Количество(), ОценкаПроизводительности_Комментарий);
	
	Если ДанныеКонструктора.ВыполнятьВПакетномРежиме Тогда
		Возврат SUI_HTTPСервис.РезультатУспех(Результат);
	Иначе
		
		Если ЗначениеЗаполнено(Результат) Тогда
			Возврат SUI_HTTPСервис.РезультатУспех(
				SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Результат, "package_0", Новый Массив(), Тип("Массив")));
		Иначе
			Возврат SUI_HTTPСервис.РезультатУспех(Результат);
		КонецЕсли;

	КонецЕсли;
	
КонецФункции

Функция СоздатьДокументПеремещенияЗапасов(МобильноеУстройство, ПараметрыСоздания) Экспорт
	
	Перем ДанныеДокументаОбмена, НастройкаДокумента;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	SUI_НастройкиДокументов.ПометкаУдаления,
		|	SUI_НастройкиДокументов.ИмяОбъектаМетаданных,
		|	SUI_НастройкиДокументов.Ссылка,
		|   SUI_НастройкиДокументов.Используется
		|ИЗ
		|	Справочник.SUI_НастройкиДокументов КАК SUI_НастройкиДокументов
		|ГДЕ
		|	SUI_НастройкиДокументов.Ссылка = &НастройкаДокумента";
	
	Запрос.УстановитьПараметр("НастройкаДокумента", ПолучитьФункциональнуюОпцию("SUI_НастройкаДокументаПеремещенияЗапасов"));
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		НастройкаДокумента = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Выборка);
	КонецЕсли;

	Если НастройкаДокумента = Неопределено Или Не ЗначениеЗаполнено(НастройкаДокумента.Ссылка) Тогда
		Возврат SUI_HTTPСервис.РезультатОшибка(НСтр("ru = 'Не удалось создать документ.
		|В центре настроек не выбрана настройка документа для создания документа перемещения запасов.'"));
	КонецЕсли;
	
	Если Не SUI_НастройкиДокументовСервер.НастройкаДокументаПринадлежитМобильномуКлиенту(НастройкаДокумента.Ссылка, МобильноеУстройство) Тогда
		Возврат SUI_HTTPСервис.РезультатОшибка(СтрШаблон(НСтр("ru = 'Не удалось создать документ.
		|Настройка документа ""%1"" не доступна мобильному клиенту.'"), НастройкаДокумента.Ссылка));
	КонецЕсли;
	
	Организация = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыСоздания, "Организация");
	Отправитель = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыСоздания, "Отправитель");
	Получатель = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыСоздания, "Получатель");

	НачатьТранзакцию();
	
	Попытка
		
		ДанныеМУ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(МобильноеУстройство, "Код,Наименование");
		
		ОбщегоНазначенияКлиентСервер.Проверить(Не НастройкаДокумента.ПометкаУдаления, 
			СтрШаблон(НСтр("ru = 'Настройка документа ""%1"" помечена на удаление.'"), НастройкаДокумента.Ссылка));
		
		ОбщегоНазначенияКлиентСервер.Проверить(НастройкаДокумента.Используется, 
			СтрШаблон(НСтр("ru = 'Настройка документа ""%1"" не используется.'"), НастройкаДокумента.Ссылка));
			
		МетаданныеДокумента = Метаданные.Документы.Найти(НастройкаДокумента.ИмяОбъектаМетаданных);
		ОбщегоНазначенияКлиентСервер.Проверить(МетаданныеДокумента <> Неопределено, 
			СтрШаблон(НСтр("ru = 'По настройке ""%1"" не удалось определить метаданные документа.'"), НастройкаДокумента.Ссылка));
		
		ДокументОбъект = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(МетаданныеДокумента.ПолноеИмя()).СоздатьДокумент();
		ДокументОбъект.Дата = ТекущаяДатаСеанса();
		
		Если Организация <> Неопределено И ОбщегоНазначения.ЕстьРеквизитОбъекта("Организация", МетаданныеДокумента) Тогда
			ДокументОбъект["Организация"] = Организация;
		КонецЕсли;
		
		Если Отправитель <> Неопределено И ОбщегоНазначения.ЕстьРеквизитОбъекта("Отправитель", МетаданныеДокумента) Тогда
			ДокументОбъект["Отправитель"] = Отправитель;
		ИначеЕсли Отправитель <> Неопределено И ОбщегоНазначения.ЕстьРеквизитОбъекта("СкладОтправитель", МетаданныеДокумента) Тогда
			ДокументОбъект["СкладОтправитель"] = Отправитель;
		КонецЕсли;
		
		Если Получатель <> Неопределено И ОбщегоНазначения.ЕстьРеквизитОбъекта("Получатель", МетаданныеДокумента) Тогда
			ДокументОбъект["Получатель"] = Получатель;
		ИначеЕсли Получатель <> Неопределено И ОбщегоНазначения.ЕстьРеквизитОбъекта("СкладПолучатель", МетаданныеДокумента) Тогда
			ДокументОбъект["СкладПолучатель"] = Получатель;
		КонецЕсли;
		
		Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Комментарий", МетаданныеДокумента) Тогда
			ДокументОбъект["Комментарий"] = СтрШаблон(НСтр("ru = ' #Simple. Создано из мобильного клиента: %1 (%2).'"), 
				ДанныеМУ.Наименование, ДанныеМУ.Код);
		КонецЕсли;
		
		// Отключить выгрузки при записи документа
		ДокументОбъект.ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов");
		ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
		
		// Получить настройки для созданного документа и проверить вхождение настройки из константы
		ОбщегоНазначенияКлиентСервер.Проверить(
			SUI_НастройкиДокументовСервер.ДокументСоответствуетОтборуНастройки(НастройкаДокумента.Ссылка, ДокументОбъект.Ссылка), 
			СтрШаблон(НСтр("ru = 'Сформированный документ не соответствует критериям отбора настройки документа ""%1"".'"), НастройкаДокумента.Ссылка));
		
		НастройкиДокумента = SUI_НастройкиДокументовСервер.СформироватьНастройкиДокумента(НастройкаДокумента.Ссылка);
		АдресноеХранение = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(НастройкиДокумента, "ЭтоДокументАдресногоХранения");
		
		ОбщегоНазначенияКлиентСервер.Проверить(АдресноеХранение <> Неопределено, 
			СтрШаблон(НСтр("ru = 'Не удалось определить тип документа по настройке ""%1"".'"), НастройкаДокумента.Ссылка));
		
		// Выгрузить документ на ТСД
		ПараметрыВыгрузкиДокументаОбмена = SUI_ДокументыОбмена.ПараметрыВыгрузкиДокументаОбмена();
		ПараметрыВыгрузкиДокументаОбмена.МобильноеУстройство 	= МобильноеУстройство;
		ПараметрыВыгрузкиДокументаОбмена.НастройкаДокумента 	= НастройкаДокумента.Ссылка;
		ПараметрыВыгрузкиДокументаОбмена.ДокументСсылка 		= ДокументОбъект.Ссылка;
		ПараметрыВыгрузкиДокументаОбмена.Вставить("SUI_АдресноеХранение", АдресноеХранение);
		ДанныеДокументаОбмена = SUI_ДокументыОбмена.ВыгрузитьИПолучитьДокументОбмена(ПараметрыВыгрузкиДокументаОбмена);
		
		ОбщегоНазначенияКлиентСервер.Проверить(ДанныеДокументаОбмена <> Неопределено, 
			НСтр("ru = 'Не удалось получить данные выгруженного документа.'"));
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(ИмяСобытия(), , 
			Метаданные.ОбщиеМодули.SUI_ОбменДаннымиСервер, , ИнформацияОбОшибке());
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось создать документ.
			|%1'"), КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;

	Возврат SUI_HTTPСервис.РезультатУспех(ДанныеДокументаОбмена);
	
КонецФункции

Функция ПолучитьОстаткиИЦены(МобильноеУстройство, Параметры) Экспорт
	
	Результат = Новый Массив();

	ДанныеКонструктора = SUI_НастройкиМетаданныхСервер.ПолучитьЗапросПолученияОстатковИЦен();
	
	ТекстЗапроса = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеКонструктора, "ТекстЗапроса", "", Тип("Строка"));
	Если ПустаяСтрока(ТекстЗапроса) Тогда
		ВызватьИсключение НСтр("ru = 'Отсутсвует текст запроса для получения остатков и цен'");
	КонецЕсли;
	
	сткПустойОбъект = Новый Структура();
	сткПустойОбъект.Вставить("id_good");
	сткПустойОбъект.Вставить("good_name");
	сткПустойОбъект.Вставить("article");
	сткПустойОбъект.Вставить("id_property");
	сткПустойОбъект.Вставить("property_name");
	сткПустойОбъект.Вставить("representation");
	сткПустойОбъект.Вставить("purpose");
	сткПустойОбъект.Вставить("qtty");
	сткПустойОбъект.Вставить("price_new");
	сткПустойОбъект.Вставить("price_old");
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Для Каждого Параметр Из Параметры Цикл
		Запрос.УстановитьПараметр(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();

	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			сткНовыйОбъект = ОбщегоНазначения.СкопироватьРекурсивно(сткПустойОбъект, Ложь);
			ЗаполнитьЗначенияСвойств(сткНовыйОбъект, ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Выборка));
			Если Не ОбщегоНазначения.КоллекцииИдентичны(сткПустойОбъект, сткНовыйОбъект) Тогда
				Результат.Добавить(сткНовыйОбъект);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат SUI_HTTPСервис.РезультатУспех(Результат);
	
КонецФункции

Функция ПолучитьОбновленияКонфигурацийПриложений(ТекущаяВерсияУстройства, ВключаяТестовыеВерсии) Экспорт
	
	Результат = Новый Структура();
	Результат.Вставить("app_configuration");
	Результат.Вставить("configuring_app_configuration");
	
	ДанныеВерсииКонфигурации = Справочники.SUI_КонфигурацииПриложений.ПолучитьПоследнююНовуюВерсию(
		ТекущаяВерсияУстройства, ВключаяТестовыеВерсии);
		
	Если ДанныеВерсииКонфигурации <> Неопределено Тогда
		
		Результат.app_configuration = Новый Структура();
		Результат.app_configuration.Вставить("version", ДанныеВерсииКонфигурации.Версия);
		Результат.app_configuration.Вставить("data", 
			Справочники.SUI_ПрисоединенныеФайлыОбщие.ПолучитьДвоичныеДанныеИзСсылки(ДанныеВерсииКонфигурации.ПрисоединенныйФайл, Истина));
		
	КонецЕсли;
	
	//TODO: Врем. пустая версия
	ВерсияДляНастройки = SUI_ОбщегоНазначенияКлиентСервер.ПустаяВерсия();
	
	ДанныеВерсииНастройкиКонфигурации = Справочники.SUI_НастройкиКонфигурацийПриложений.ПолучитьПоследнююНовуюВерсию(
		ВерсияДляНастройки, ВключаяТестовыеВерсии);
		
	Если ДанныеВерсииНастройкиКонфигурации <> Неопределено Тогда
		
		Результат.configuring_app_configuration = Новый Структура();
		Результат.configuring_app_configuration.Вставить("version", ДанныеВерсииНастройкиКонфигурации.Версия);
		Результат.configuring_app_configuration.Вставить("data", 
			Справочники.SUI_ПрисоединенныеФайлыОбщие.ПолучитьДвоичныеДанныеИзСсылки(ДанныеВерсииНастройкиКонфигурации.ПрисоединенныйФайл, Истина));
		
	КонецЕсли;
	
	Возврат SUI_HTTPСервис.РезультатУспех(Результат);
	
КонецФункции

#Область МодификацияПодКлиента

Функция ПолучитьЯчейкиТовара(ОтборРазмещениеСсылка, Номенклатура) Экспорт
	
	Результат = Новый Массив();
	
	ОписаниеТипаДокумент = Новый ОписаниеТипов("ДокументСсылка.ОтборРазмещениеТоваров");
	ОписаниеТипаНоменклатура = Новый ОписаниеТипов("СправочникСсылка.Номенклатура");
	
	Если Не ЗначениеЗаполнено(ОписаниеТипаДокумент.ПривестиЗначение(ОтборРазмещениеСсылка)) Тогда
		Возврат SUI_HTTPСервис.РезультатОшибка(НСтр("ru = 'Не передан документ Отбор размещение товаров!'"), 400);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ОписаниеТипаНоменклатура.ПривестиЗначение(Номенклатура)) Тогда
		Возврат SUI_HTTPСервис.РезультатОшибка(НСтр("ru = 'Не передана номенклатура!'"), 400);
	КонецЕсли;
	
	Склад = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОтборРазмещениеСсылка, "Склад");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыВЯчейкахОстатки.Ячейка КАК id_cell,
		|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Ячейка.Код, """") КАК name_cell,
		|	СУММА(ТоварыВЯчейкахОстатки.ВНаличииОстаток) КАК qtty
		|ИЗ
		|	РегистрНакопления.ТоварыВЯчейках.Остатки(
		|			&ДатаЗапроса,
		|			Номенклатура = &Номенклатура
		|				И Ячейка.Владелец = &Склад) КАК ТоварыВЯчейкахОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ТоварыВЯчейкахОстатки.Ячейка,
		|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Ячейка.Код, """")";
	
	Запрос.УстановитьПараметр("ДатаЗапроса", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Склад", Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Результат.Добавить(ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Выборка)); 
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат SUI_HTTPСервис.РезультатУспех(Результат);
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ВосстановлениеДанныхJSON

Функция ВосстановлениеДанныхJSON_ДанныеДокумента(Свойство, Значение, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(Свойство) Тогда
		Возврат Значение;
	КонецЕсли;
	
	ОписаниеСтруктура = Новый ОписаниеТипов("Структура");   
	
	ПараметрыСвойства = ОписаниеСтруктура.ПривестиЗначение(ДополнительныеПараметры);
	
	Если ПараметрыСвойства.Свойство(Свойство) Тогда
		ПараметрыСвойства = ОписаниеСтруктура.ПривестиЗначение(ПараметрыСвойства[Свойство]);	
	Иначе
		ПараметрыСвойства = Новый Структура();	
	КонецЕсли;
	
	АдресХранения = Неопределено;
	ПараметрыСвойства.Свойство("АдресХранения", АдресХранения);
	
	ИмяСвойства = НРег(Свойство);
	
	Если СтрНайти("doc_date, production_date, best_before", ИмяСвойства) Тогда
		Возврат SUI_ОбщегоНазначения.ВосстановлениеДанныхJSON_ВосстановитьДату(Значение);
	ИначеЕсли ИмяСвойства = "rs_docs_table" Или ИмяСвойства = "rs_adr_docs_table" Тогда
		Возврат ВосстановлениеДанныхJSON_ДанныеДокумента_ТоварыДокумента(Значение, АдресХранения);
	ИначеЕсли ИмяСвойства = "rs_docs_barcodes" Тогда
		Возврат ВосстановлениеДанныхJSON_ДанныеДокумента_ШтрихкодыДокумента(Значение, АдресХранения);	
	ИначеЕсли ИмяСвойства = "rs_barc_flow" Тогда
		Возврат ВосстановлениеДанныхJSON_ДанныеДокумента_ПотокШтрихкодов(Значение, АдресХранения);
	ИначеЕсли ИмяСвойства = "rs_docs_series" Тогда
		Возврат ВосстановлениеДанныхJSON_ДанныеДокумента_СерииДокумента(Значение, АдресХранения);
	Иначе
		
		Если ЗначениеЗаполнено(Значение) Тогда
			
			Если ИмяСвойства = "id_doc" Или ИмяСвойства = "id_good" Или ИмяСвойства = "id_properties" Или ИмяСвойства = "id_series" Или 
				ИмяСвойства = "id_unit" Или ИмяСвойства = "id_cell" Или ИмяСвойства = "id_price" Или 
				ИмяСвойства = "id_marking_code" Или ИмяСвойства = "id_property" Тогда
				ОбщегоНазначенияКлиентСервер.Проверить(
					SUI_ИнтеграцияВКонфигурациюКлиентСервер.ЭтоИдентификаторSimple(Значение),
					СтрШаблон(НСтр("ru = 'Значение ""%1"" ключа ""%2"" не является идентификатором Simple.'"), Значение, Свойство));
			КонецЕсли;
			
		Иначе
			
			Если ИмяСвойства = "id_doc" Тогда
				ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Не заполнен идентификатор документа (%1).'"), Свойство);
			КонецЕсли;
			
			Если ИмяСвойства = "id_good" Тогда
				ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Не заполнен идентификатор номенклатуры (%1).'"), Свойство);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции

Функция ВосстановлениеДанныхJSON_ПересчетТоваровДокумента(Свойство, Значение, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Свойство) Тогда
		
		ИмяСвойства = НРег(Свойство);
		
		Если ЗначениеЗаполнено(Значение) Тогда
				
			Если (ИмяСвойства = "id_good" Или ИмяСвойства = "id_properties" Или 
				ИмяСвойства = "id_series" Или ИмяСвойства = "id_unit" Или 
				ИмяСвойства = "id_cell" Или ИмяСвойства = "id_price") И
				Не SUI_ИнтеграцияВКонфигурациюКлиентСервер.ЭтоИдентификаторSimple(Значение) Тогда
				
				ТекстОшибки = НСтр("ru = 'Значение ""%1"" ключа ""%2"" не является идентификатором Simple.'");
				ТекстОшибки = СтрШаблон(ТекстОшибки, Значение, Свойство);
				ВызватьИсключение ТекстОшибки;
				
			КонецЕсли;
			
		ИначеЕсли ИмяСвойства = "id_good" Тогда
			ВызватьИсключение СтрШаблон(НСтр("ru = 'Не заполнен идентификатор номенклатуры (%1).'"), Свойство);
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Значение) = Тип("Массив") Тогда
		
		Таблица = SUI_ДокументыОбмена.ТаблицаПересчетТоваровДокументаОбмена();
		
		Если Таблица.Колонки.Найти("id_doc") = Неопределено Тогда
			Таблица.Колонки.Добавить("id_doc", ОбщегоНазначения.ОписаниеТипаСтрока(69));
		КонецЕсли;
		
		ИдентификаторДокумента = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
			ДополнительныеПараметры, "ИдентификаторДокумента", "", Тип("Строка"));
		
		Если Не SUI_ИнтеграцияВКонфигурациюКлиентСервер.ЭтоИдентификаторSimple(ИдентификаторДокумента) Тогда
			ИдентификаторДокумента = "";
		КонецЕсли;
		
		Для индекс = 0 По Значение.ВГраница() Цикл
			
			Если Не Значение[индекс].Свойство("table_type") Тогда
				ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Товары;
			ИначеЕсли Значение[индекс].table_type = "in" Тогда
				ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Размещение;
			ИначеЕсли Значение[индекс].table_type = "out" Тогда
				ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Отбор;
			Иначе
				ТекстОшибки = НСтр("ru = 'Строка пересчета ""%1"" содержит ошибку:
				|Передан неизвестный тип таблицы ""%2"".'");
				ВызватьИсключение СтрШаблон(ТекстОшибки, индекс, Значение[индекс].table_type);
			КонецЕсли;
			
			СтрокаТаблицы = Таблица.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТаблицы, Значение[индекс]);
			
			СтрокаТаблицы.ТипТаблицы = ТипТаблицы;
			
			Если Не ПустаяСтрока(ИдентификаторДокумента) Тогда
				
				Если Не ПустаяСтрока(СтрокаТаблицы.id_doc) И
					СтрокаТаблицы.id_doc <> ИдентификаторДокумента Тогда
						
					ТекстОшибки = НСтр("ru = 'Строка пересчета ""%1"" содержит ошибку:
					|Идентификатор документа ""%2"" отличается от переданного в запросе ""%3"".'");
					ВызватьИсключение СтрШаблон(ТекстОшибки, индекс, СтрокаТаблицы.id_doc, ИдентификаторДокумента);
					
				Иначе
					СтрокаТаблицы.id_doc = ИдентификаторДокумента;
				КонецЕсли;
				
			ИначеЕсли ПустаяСтрока(СтрокаТаблицы.id_doc) Тогда
				
				ТекстОшибки = НСтр("ru = 'Строка пересчета ""%1"" содержит ошибку:
				|Не передан идентификатор документа.'");
				ВызватьИсключение СтрШаблон(ТекстОшибки, индекс);
				
			КонецЕсли;
			
		КонецЦикла;
		
		ПересчетПоДокументам = Новый Соответствие();
		
		Если ПустаяСтрока(ИдентификаторДокумента) Тогда
			
			ИдентификаторыДокументов = ОбщегоНазначенияКлиентСервер.СвернутьМассив(Таблица.ВыгрузитьКолонку("id_doc"));
			
			Для индекс = 0 По ИдентификаторыДокументов.ВГраница() Цикл
				
				Отбор = Новый Структура("id_doc", ИдентификаторыДокументов[индекс]);
				ПересчетПоДокументам.Вставить(Отбор.id_doc, Таблица.Скопировать(Отбор));
				
			КонецЦикла;
			
		Иначе
			ПересчетПоДокументам.Вставить(ИдентификаторДокумента, Таблица);
		КонецЕсли;
		
		Значение = ПересчетПоДокументам;
		
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции

Функция ВосстановлениеДанныхJSON_СоздатьШтрихкодыНоменклатуры(Свойство, Значение, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(Свойство) Тогда
		Если ТипЗнч(Значение) = Тип("Массив") Тогда
			Возврат ВосстановлениеДанныхJSON_ДанныеШтрихкодов_СоздатьШтрихкодыНоменклатуры(Значение);
		Иначе
			Возврат Значение;
		КонецЕсли;
	КонецЕсли;

	ИмяСвойства = НРег(Свойство);

	Если ЗначениеЗаполнено(Значение) Тогда
			
		Если ИмяСвойства = "id_good" Или ИмяСвойства = "id_property" Или ИмяСвойства = "id_unit" Тогда
			ОбщегоНазначенияКлиентСервер.Проверить(SUI_ИнтеграцияВКонфигурациюКлиентСервер.ЭтоИдентификаторSimple(Значение),
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Значение ""%1"" ключа ""%2"" не является идентификатором Simple.'"), Значение, Свойство));
		КонецЕсли;
		
	Иначе
		
		Если ИмяСвойства = "barcode" Тогда
			ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Передано пустое значение штрихкода номенклатуры (%1).'"), Свойство);
		КонецЕсли;
		
		Если ИмяСвойства = "id_good" Тогда
			ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не заполнен идентификатор номенклатуры (%1).'"), Свойство);
		КонецЕсли;

	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции

Функция ВосстановлениеДанныхJSON_НастройкиПользовательскогоЗапроса(Свойство, Значение, ДополнительныеПараметры) Экспорт
	
	Если Свойство = Неопределено И ТипЗнч(Значение) = Тип("Структура") И
		Значение.Количество() = 3 И
		Значение.Свойство("isID") И Значение.Свойство("name") И Значение.Свойство("value") Тогда
		
		Значение.Вставить("isID", SUI_ОбщегоНазначенияКлиентСервер.ОписаниеТипаБулево().ПривестиЗначение(Значение.isID));
		Значение.Вставить("name", ОбщегоНазначения.ОписаниеТипаСтрока(0).ПривестиЗначение(Значение.name));
		
		ОписаниеТипаИД = ОбщегоНазначения.ОписаниеТипаСтрока(69);
		
		Если ТипЗнч(Значение.value) = Тип("Массив") Тогда
			
			Если Значение.isID Тогда
				
				МассивЗначений = Новый Массив();
				Для Каждого value Из Значение.value Цикл
					Ссылка = SUI_ИнтеграцияВКонфигурацию.СсылкаПоИдентификаторуSimple(
						ОписаниеТипаИД.ПривестиЗначение(value));
					Если ЗначениеЗаполнено(Ссылка) Тогда
						МассивЗначений.Добавить(Ссылка);
					КонецЕсли;
				КонецЦикла;
				Значение.Вставить("value", ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивЗначений));
				
			Иначе
				Значение.Вставить("value", ОбщегоНазначенияКлиентСервер.СвернутьМассив(Значение.value));
			КонецЕсли;
			
		Иначе 
			
			Если Значение.isID Тогда
				Значение.Вставить("value", SUI_ИнтеграцияВКонфигурацию.СсылкаПоИдентификаторуSimple(
					ОписаниеТипаИД.ПривестиЗначение(Значение.value)));
			КонецЕсли;
			
		КонецЕсли;
			
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции

Процедура ВыполнитьАлгоритмСозданияДокумента(Алгоритм, МобильноеУстройство, ДокументОбъект) Экспорт
	
	УстановитьБезопасныйРежим(Истина);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ТехнологияСервиса.БазоваяФункциональность") Тогда
		МодульРаботаВМоделиСервиса = ОбщегоНазначения.ОбщийМодуль("РаботаВМоделиСервиса");
		МассивРазделителей = МодульРаботаВМоделиСервиса.РазделителиКонфигурации();
	Иначе
		МассивРазделителей = Новый Массив;
	КонецЕсли;
	
	Для Каждого ИмяРазделителя Из МассивРазделителей Цикл
		
		УстановитьБезопасныйРежимРазделенияДанных(ИмяРазделителя, Истина);
		
	КонецЦикла;
	
	Выполнить(Алгоритм);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

// Функция - Имя события журнала регистрации
// 
// Возвращаемое значение:
//  Строка - имя события журнала регистрации
//
Функция ИмяСобытия()
	Возврат НСтр("ru = 'Обмен данными'", ОбщегоНазначения.КодОсновногоЯзыка());
КонецФункции

Функция КонтекстВызова(ВложенныйКонтекстВызова = "")
	
	Если ЗначениеЗаполнено(ВложенныйКонтекстВызова) Тогда
		Возврат ВложенныйКонтекстВызова + " (" + Метаданные.ОбщиеМодули.SUI_ОбменДаннымиСервер.ПолноеИмя() + ")";
	Иначе
		Возврат Метаданные.ОбщиеМодули.SUI_ОбменДаннымиСервер.ПолноеИмя();
	КонецЕсли;
	
КонецФункции

#Область ВосстановлениеДанныхJSON_ДанныеДокументов

Функция ВосстановлениеДанныхJSON_ДанныеДокумента_ТоварыДокумента(мсвДанные, АдресХранения = Неопределено)
	
	Таблица = SUI_ДокументыОбмена.ТаблицаТоварыДокументаОбмена();
	
	Если ТипЗнч(мсвДанные) = Тип("Массив") Тогда

		Для Каждого Элемент Из мсвДанные Цикл 
			
			Если ТипЗнч(Элемент) <> Тип("Структура") Тогда
				Продолжить;	
			КонецЕсли; 
			
			Если Не Элемент.Свойство("table_type") Тогда
				ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Товары;
			Иначе
				
				Если Элемент.table_type = "in" Тогда
					ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Размещение;
				ИначеЕсли Элемент.table_type = "out" Тогда
					ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Отбор;
				Иначе
					Продолжить;
				КонецЕсли;
			
			КонецЕсли;
			
			СтрокаТаблицы = Таблица.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТаблицы, Элемент);
			
			СтрокаТаблицы.ТипТаблицы = ТипТаблицы;

		КонецЦикла;
	
	КонецЕсли;
	
	Если ЭтоАдресВременногоХранилища(АдресХранения) Тогда
		Возврат ПоместитьВоВременноеХранилище(Таблица, АдресХранения);	
	Иначе 
		Возврат Таблица;	
	КонецЕсли;

КонецФункции

Функция ВосстановлениеДанныхJSON_ДанныеДокумента_СерииДокумента(мсвДанные, АдресХранения = Неопределено)
	
	Таблица = SUI_ДокументыОбмена.ТаблицаСерииДокументаОбмена();
	
	Если ТипЗнч(мсвДанные) = Тип("Массив") Тогда

		Для Каждого Элемент Из мсвДанные Цикл 
			
			Если ТипЗнч(Элемент) <> Тип("Структура") Тогда
				Продолжить;	
			КонецЕсли;
			
			НоваяСтрока = Таблица.Добавить();
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Элемент);
			
			НоваяСтрока.name = ОбщегоНазначенияКлиентСервер.УдалитьНедопустимыеСимволыXML(НоваяСтрока.name);
			НоваяСтрока.number = ОбщегоНазначенияКлиентСервер.УдалитьНедопустимыеСимволыXML(НоваяСтрока.number);
			
		КонецЦикла;
	
	КонецЕсли;

	Если ЭтоАдресВременногоХранилища(АдресХранения) Тогда
		Возврат ПоместитьВоВременноеХранилище(Таблица, АдресХранения);
	Иначе 
		Возврат Таблица;	
	КонецЕсли;

КонецФункции

Функция ВосстановлениеДанныхJSON_ДанныеДокумента_ШтрихкодыДокумента(мсвДанные, АдресХранения = Неопределено)
	
	Таблица = SUI_ДокументыОбмена.ТаблицаШтрихкодыДокументаОбмена();
	
	Если SUI_НастройкиМетаданныхСервер.ТаблицаИспользуется(Перечисления.SUI_ТаблицыИнтеграции.ШтрихкодыУпаковок) И
		ТипЗнч(мсвДанные) = Тип("Массив") Тогда
		
		НастройкаШтрихкодовУпаковок = SUI_НастройкиМетаданныхСервер.ПолучитьДополнительныеНастройки(
			Перечисления.SUI_ТаблицыИнтеграции.ШтрихкодыУпаковок);
		АлгоритмНормализации = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(НастройкаШтрихкодовУпаковок,
			"АлгоритмНормализацииЗначенияШтрихкода.Алгоритм", "", Тип("Строка"));
		
		ОписаниеТипаШтрихкод = ОбщегоНазначения.ОписаниеТипаСтрока(200);
		
		Для Каждого Элемент Из мсвДанные Цикл
			
			Элемент.Вставить("barcode_from_scanner", ОбщегоНазначенияКлиентСервер.УдалитьНедопустимыеСимволыXML(
				ОписаниеТипаШтрихкод.ПривестиЗначение(Элемент.barcode_from_scanner)));
			
			Если ПустаяСтрока(Элемент.barcode_from_scanner) Тогда
				Продолжить;
			КонецЕсли;
			
			Элемент.Вставить("mark_code", SUI_ШтрихкодыУпаковок.НормализоватьЗначениеШтрихкода(
				АлгоритмНормализации, Элемент.barcode_from_scanner));
			
			Если ПустаяСтрока(Элемент.mark_code) Тогда
				Продолжить;
			КонецЕсли;
			
			Элемент.Вставить("SSCC", SUI_ШтрихкодыУпаковок.НормализоватьЗначениеШтрихкода(
				АлгоритмНормализации, Элемент.SSCC));
			
			ЗаполнитьЗначенияСвойств(Таблица.Добавить(), Элемент);
			
		КонецЦикла;
		
	КонецЕсли;

	Если ЭтоАдресВременногоХранилища(АдресХранения) Тогда
		Возврат ПоместитьВоВременноеХранилище(Таблица, АдресХранения);	
	Иначе 
		Возврат Таблица;	
	КонецЕсли;

КонецФункции

Функция ВосстановлениеДанныхJSON_ДанныеДокумента_ПотокШтрихкодов(мсвДанные, АдресХранения = Неопределено)
	
	Таблица = SUI_ДокументыОбмена.ТаблицаПотокШтрихкодовОбмена();
	
	Если ТипЗнч(мсвДанные) = Тип("Массив") Тогда

		Для Каждого Элемент Из мсвДанные Цикл
			
			Если ТипЗнч(Элемент) <> Тип("Структура") Тогда
				Продолжить;	
			КонецЕсли;
			
			НоваяСтрока = Таблица.Добавить();
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Элемент);
			
			НоваяСтрока.barcode = ОбщегоНазначенияКлиентСервер.УдалитьНедопустимыеСимволыXML(НоваяСтрока.barcode);
			
		КонецЦикла;

	КонецЕсли;
	
	Если ЭтоАдресВременногоХранилища(АдресХранения) Тогда
		Возврат ПоместитьВоВременноеХранилище(Таблица, АдресХранения);	
	Иначе 
		Возврат Таблица;
	КонецЕсли;

КонецФункции

Функция ВосстановлениеДанныхJSON_ДанныеШтрихкодов_СоздатьШтрихкодыНоменклатуры(мсвДанные) 
	
	Таблица = Новый ТаблицаЗначений();
	Таблица.Колонки.Добавить("barcode", ОбщегоНазначения.ОписаниеТипаСтрока(200));
	Таблица.Колонки.Добавить("id_good", ОбщегоНазначения.ОписаниеТипаСтрока(69));
	Таблица.Колонки.Добавить("id_property", ОбщегоНазначения.ОписаниеТипаСтрока(69));
	Таблица.Колонки.Добавить("id_unit", ОбщегоНазначения.ОписаниеТипаСтрока(69));

	Для Каждого Элемент Из мсвДанные Цикл
		
		НоваяСтрока = Таблица.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Элемент);
		
		НоваяСтрока.barcode = ОбщегоНазначенияКлиентСервер.УдалитьНедопустимыеСимволыXML(НоваяСтрока.barcode);

		ОбщегоНазначенияКлиентСервер.Проверить(ЗначениеЗаполнено(НоваяСтрока.barcode),
			НСтр("ru = 'Передано пустое значение штрихкода номенклатуры.'"));
			
		ОбщегоНазначенияКлиентСервер.Проверить(ЗначениеЗаполнено(НоваяСтрока.id_good),
			НСтр("ru = 'Не заполнен идентификатор номенклатуры.'"));
		
	КонецЦикла;
	
	Таблица.Свернуть("barcode,id_good,id_property,id_unit");

	Возврат Таблица;
	
КонецФункции

#КонецОбласти

#КонецОбласти
